<a href="https://colab.research.google.com/github/Neeschal1/Pandas/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.12/dist-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.0.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.12/dist-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.12/dist-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.12/dist-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [3]:
import pandas as pd

**Program Begins**

In [5]:
df = pd.Series([10, 20, 30, 40, 50, "Neeschal"]) # This gives dtype as object as one of the series has string value in it.
print(df)

0          10
1          20
2          30
3          40
4          50
5    Neeschal
dtype: object

In [6]:
data = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10]) # This will give dtype as object, as all the data inside the list are integers.
print(data)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
data.name = "Marks" # Giving name to the series.

In [11]:
data

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: Marks, dtype: int64

Indexing and **slicing**, Just like it was done in Numpy

In [12]:
data[0] # Finding the elements of data series in 0th index

np.int64(1)

In [13]:
data[0:5] # Including all the elements between 0th index and 5th index

0    1
1    2
2    3
3    4
4    5
Name: Marks, dtype: int64

In [14]:
data[0:8:2] # Including all the elements between 0th index and 8th index, jumping 1 value

0    1
2    3
4    5
6    7
Name: Marks, dtype: int64